app/views/tasks/_form.html.erb

SELECT "categories".* FROM "categories"
---
      <%= form.label :category_id, "Category", class: "block text-sm font-medium text-gray-700" %>
      <%= form.collection_select :category_id, Category.all, :id, :name, { include_blank: "Select a category" }, class: "mt-1 block w-full rounded-md border-gray-300 shadow-sm focus:border-blue-500 focus:ring-blue-500 sm:text-sm p-2 border" %>