app/controllers/tasks_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (2, 4, 3, 1)
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."due_date" ASC
---
  def index
    @tasks = Task.includes(:category).by_due_date